### 📦 Plan for `sbx/eu-west-1/infra-01/vpc`
```hcl
08:09:39.398 STDOUT terraform: Terraform used the selected providers to generate the following execution
08:09:39.398 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
08:09:39.398 STDOUT terraform:   + create
08:09:39.398 STDOUT terraform: Terraform will perform the following actions:
08:09:39.399 STDOUT terraform:   # aws_eip.nat_gw_elastic_ip will be created
08:09:39.399 STDOUT terraform:   + resource "aws_eip" "nat_gw_elastic_ip" {
08:09:39.399 STDOUT terraform:       + allocation_id        = (known after apply)
08:09:39.399 STDOUT terraform:       + arn                  = (known after apply)
08:09:39.399 STDOUT terraform:       + association_id       = (known after apply)
08:09:39.399 STDOUT terraform:       + carrier_ip           = (known after apply)
08:09:39.399 STDOUT terraform:       + customer_owned_ip    = (known after apply)
08:09:39.399 STDOUT terraform:       + domain               = "vpc"
08:09:39.399 STDOUT terraform:       + id                   = (known after apply)
08:09:39.399 STDOUT terraform:       + instance             = (known after apply)
08:09:39.399 STDOUT terraform:       + ipam_pool_id         = (known after apply)
08:09:39.399 STDOUT terraform:       + network_border_group = (known after apply)
08:09:39.399 STDOUT terraform:       + network_interface    = (known after apply)
08:09:39.399 STDOUT terraform:       + private_dns          = (known after apply)
08:09:39.399 STDOUT terraform:       + private_ip           = (known after apply)
08:09:39.399 STDOUT terraform:       + ptr_record           = (known after apply)
08:09:39.399 STDOUT terraform:       + public_dns           = (known after apply)
08:09:39.399 STDOUT terraform:       + public_ip            = (known after apply)
08:09:39.399 STDOUT terraform:       + public_ipv4_pool     = (known after apply)
08:09:39.399 STDOUT terraform:       + tags                 = {
08:09:39.399 STDOUT terraform:           + "Name" = "sbx-dev-eu-west-1-infra-01-nap-eip"
08:09:39.399 STDOUT terraform:         }
08:09:39.400 STDOUT terraform:       + tags_all             = {
08:09:39.400 STDOUT terraform:           + "Data-classification" = "internal"
08:09:39.400 STDOUT terraform:           + "Environment"         = "dev"
08:09:39.400 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:09:39.400 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-nap-eip"
08:09:39.400 STDOUT terraform:           + "Organization"        = "genopsx"
08:09:39.400 STDOUT terraform:         }
08:09:39.400 STDOUT terraform:       + vpc                  = (known after apply)
08:09:39.400 STDOUT terraform:     }
08:09:39.400 STDOUT terraform:   # module.vpc.aws_cloudwatch_log_group.flow_log[0] will be created
08:09:39.400 STDOUT terraform:   + resource "aws_cloudwatch_log_group" "flow_log" {
08:09:39.400 STDOUT terraform:       + arn               = (known after apply)
08:09:39.400 STDOUT terraform:       + id                = (known after apply)
08:09:39.400 STDOUT terraform:       + log_group_class   = (known after apply)
08:09:39.400 STDOUT terraform:       + name              = (known after apply)
08:09:39.400 STDOUT terraform:       + name_prefix       = (known after apply)
08:09:39.400 STDOUT terraform:       + retention_in_days = 0
08:09:39.400 STDOUT terraform:       + skip_destroy      = false
08:09:39.400 STDOUT terraform:       + tags              = {
08:09:39.400 STDOUT terraform:           + "Environment" = "dev"
08:09:39.400 STDOUT terraform:           + "Terragrunt"  = "true"
08:09:39.400 STDOUT terraform:           + "infra"       = "true"
08:09:39.400 STDOUT terraform:         }
08:09:39.400 STDOUT terraform:       + tags_all          = {
08:09:39.400 STDOUT terraform:           + "Data-classification" = "internal"
08:09:39.400 STDOUT terraform:           + "Environment"         = "dev"
08:09:39.400 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:09:39.400 STDOUT terraform:           + "Organization"        = "genopsx"
08:09:39.400 STDOUT terraform:           + "Terragrunt"          = "true"
08:09:39.400 STDOUT terraform:           + "infra"               = "true"
08:09:39.400 STDOUT terraform:         }
08:09:39.400 STDOUT terraform:     }
08:09:39.400 STDOUT terraform:   # module.vpc.aws_db_subnet_group.database[0] will be created
08:09:39.400 STDOUT terraform:   + resource "aws_db_subnet_group" "database" {
08:09:39.400 STDOUT terraform:       + arn                     = (known after apply)
08:09:39.400 STDOUT terraform:       + description             = "Database subnet group for sbx-dev-eu-west-1-infra-01-vpc"
08:09:39.401 STDOUT terraform:       + id                      = (known after apply)
08:09:39.401 STDOUT terraform:       + name                    = "sbx-dev-eu-west-1-infra-01-vpc"
08:09:39.401 STDOUT terraform:       + name_prefix             = (known after apply)
08:09:39.401 STDOUT terraform:       + subnet_ids              = (known after apply)
08:09:39.401 STDOUT terraform:       + supported_network_types = (known after apply)
08:09:39.401 STDOUT terraform:       + tags                    = {
08:09:39.401 STDOUT terraform:           + "Environment" = "dev"
08:09:39.401 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-infra-01-vpc"
08:09:39.401 STDOUT terraform:           + "Terragrunt"  = "true"
08:09:39.401 STDOUT terraform:           + "infra"       = "true"
08:09:39.401 STDOUT terraform:         }
08:09:39.401 STDOUT terraform:       + tags_all                = {
08:09:39.401 STDOUT terraform:           + "Data-classification" = "internal"
08:09:39.401 STDOUT terraform:           + "Environment"         = "dev"
08:09:39.401 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:09:39.401 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-vpc"
08:09:39.401 STDOUT terraform:           + "Organization"        = "genopsx"
08:09:39.401 STDOUT terraform:           + "Terragrunt"          = "true"
08:09:39.401 STDOUT terraform:           + "infra"               = "true"
08:09:39.401 STDOUT terraform:         }
08:09:39.401 STDOUT terraform:       + vpc_id                  = (known after apply)
08:09:39.401 STDOUT terraform:     }
08:09:39.401 STDOUT terraform:   # module.vpc.aws_default_network_acl.this[0] will be created
08:09:39.401 STDOUT terraform:   + resource "aws_default_network_acl" "this" {
08:09:39.401 STDOUT terraform:       + arn                    = (known after apply)
08:09:39.401 STDOUT terraform:       + default_network_acl_id = (known after apply)
08:09:39.401 STDOUT terraform:       + id                     = (known after apply)
08:09:39.401 STDOUT terraform:       + owner_id               = (known after apply)
08:09:39.401 STDOUT terraform:       + tags                   = {
08:09:39.401 STDOUT terraform:           + "Environment" = "dev"
08:09:39.401 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-default"
08:09:39.401 STDOUT terraform:           + "Terragrunt"  = "true"
08:09:39.401 STDOUT terraform:           + "infra"       = "true"
08:09:39.401 STDOUT terraform:         }
08:09:39.401 STDOUT terraform:       + tags_all               = {
08:09:39.401 STDOUT terraform:           + "Data-classification" = "internal"
08:09:39.401 STDOUT terraform:           + "Environment"         = "dev"
08:09:39.401 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:09:39.401 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-default"
08:09:39.401 STDOUT terraform:           + "Organization"        = "genopsx"
08:09:39.401 STDOUT terraform:           + "Terragrunt"          = "true"
08:09:39.401 STDOUT terraform:           + "infra"               = "true"
08:09:39.401 STDOUT terraform:         }
08:09:39.401 STDOUT terraform:       + vpc_id                 = (known after apply)
08:09:39.402 STDOUT terraform:       + egress {
08:09:39.402 STDOUT terraform:           + action          = "allow"
08:09:39.402 STDOUT terraform:           + from_port       = 0
08:09:39.402 STDOUT terraform:           + ipv6_cidr_block = "::/0"
08:09:39.402 STDOUT terraform:           + protocol        = "-1"
08:09:39.402 STDOUT terraform:           + rule_no         = 101
08:09:39.402 STDOUT terraform:           + to_port         = 0
08:09:39.402 STDOUT terraform:             # (1 unchanged attribute hidden)
08:09:39.402 STDOUT terraform:         }
08:09:39.402 STDOUT terraform:       + egress {
08:09:39.402 STDOUT terraform:           + action          = "allow"
08:09:39.402 STDOUT terraform:           + cidr_block      = "0.0.0.0/0"
08:09:39.402 STDOUT terraform:           + from_port       = 0
08:09:39.402 STDOUT terraform:           + protocol        = "-1"
08:09:39.402 STDOUT terraform:           + rule_no         = 100
08:09:39.402 STDOUT terraform:           + to_port         = 0
08:09:39.402 STDOUT terraform:             # (1 unchanged attribute hidden)
08:09:39.402 STDOUT terraform:         }
08:09:39.402 STDOUT terraform:       + ingress {
08:09:39.402 STDOUT terraform:           + action          = "allow"
08:09:39.402 STDOUT terraform:           + from_port       = 0
08:09:39.402 STDOUT terraform:           + ipv6_cidr_block = "::/0"
08:09:39.402 STDOUT terraform:           + protocol        = "-1"
08:09:39.402 STDOUT terraform:           + rule_no         = 101
08:09:39.402 STDOUT terraform:           + to_port         = 0
08:09:39.402 STDOUT terraform:             # (1 unchanged attribute hidden)
08:09:39.402 STDOUT terraform:         }
08:09:39.402 STDOUT terraform:       + ingress {
08:09:39.402 STDOUT terraform:           + action          = "allow"
08:09:39.402 STDOUT terraform:           + cidr_block      = "0.0.0.0/0"
08:09:39.402 STDOUT terraform:           + from_port       = 0
08:09:39.402 STDOUT terraform:           + protocol        = "-1"
08:09:39.402 STDOUT terraform:           + rule_no         = 100
08:09:39.402 STDOUT terraform:           + to_port         = 0
08:09:39.402 STDOUT terraform:             # (1 unchanged attribute hidden)
08:09:39.402 STDOUT terraform:         }
08:09:39.402 STDOUT terraform:     }
08:09:39.402 STDOUT terraform:   # module.vpc.aws_default_route_table.default[0] will be created
08:09:39.402 STDOUT terraform:   + resource "aws_default_route_table" "default" {
08:09:39.402 STDOUT terraform:       + arn                    = (known after apply)
08:09:39.402 STDOUT terraform:       + default_route_table_id = (known after apply)
08:09:39.402 STDOUT terraform:       + id                     = (known after apply)
08:09:39.402 STDOUT terraform:       + owner_id               = (known after apply)
08:09:39.402 STDOUT terraform:       + route                  = (known after apply)
08:09:39.402 STDOUT terraform:       + tags                   = {
08:09:39.402 STDOUT terraform:           + "Environment" = "dev"
08:09:39.402 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-default"
08:09:39.402 STDOUT terraform:           + "Terragrunt"  = "true"
08:09:39.402 STDOUT terraform:           + "infra"       = "true"
08:09:39.402 STDOUT terraform:         }
08:09:39.402 STDOUT terraform:       + tags_all               = {
08:09:39.402 STDOUT terraform:           + "Data-classification" = "internal"
08:09:39.402 STDOUT terraform:           + "Environment"         = "dev"
08:09:39.402 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:09:39.402 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-default"
08:09:39.402 STDOUT terraform:           + "Organization"        = "genopsx"
08:09:39.402 STDOUT terraform:           + "Terragrunt"          = "true"
08:09:39.402 STDOUT terraform:           + "infra"               = "true"
08:09:39.402 STDOUT terraform:         }
08:09:39.403 STDOUT terraform:       + vpc_id                 = (known after apply)
08:09:39.403 STDOUT terraform:       + timeouts {
08:09:39.403 STDOUT terraform:           + create = "5m"
08:09:39.403 STDOUT terraform:           + update = "5m"
08:09:39.403 STDOUT terraform:         }
08:09:39.403 STDOUT terraform:     }
08:09:39.403 STDOUT terraform:   # module.vpc.aws_default_security_group.this[0] will be created
08:09:39.403 STDOUT terraform:   + resource "aws_default_security_group" "this" {
08:09:39.403 STDOUT terraform:       + arn                    = (known after apply)
08:09:39.403 STDOUT terraform:       + description            = (known after apply)
08:09:39.403 STDOUT terraform:       + egress                 = (known after apply)
08:09:39.403 STDOUT terraform:       + id                     = (known after apply)
08:09:39.403 STDOUT terraform:       + ingress                = (known after apply)
08:09:39.403 STDOUT terraform:       + name                   = (known after apply)
08:09:39.403 STDOUT terraform:       + name_prefix            = (known after apply)
08:09:39.403 STDOUT terraform:       + owner_id               = (known after apply)
08:09:39.403 STDOUT terraform:       + revoke_rules_on_delete = false
08:09:39.403 STDOUT terraform:       + tags                   = {
08:09:39.403 STDOUT terraform:           + "Environment" = "dev"
08:09:39.403 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-default"
08:09:39.403 STDOUT terraform:           + "Terragrunt"  = "true"
08:09:39.403 STDOUT terraform:           + "infra"       = "true"
08:09:39.403 STDOUT terraform:         }
08:09:39.403 STDOUT terraform:       + tags_all               = {
08:09:39.403 STDOUT terraform:           + "Data-classification" = "internal"
08:09:39.403 STDOUT terraform:           + "Environment"         = "dev"
08:09:39.403 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:09:39.403 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-default"
08:09:39.403 STDOUT terraform:           + "Organization"        = "genopsx"
08:09:39.403 STDOUT terraform:           + "Terragrunt"          = "true"
08:09:39.403 STDOUT terraform:           + "infra"               = "true"
08:09:39.403 STDOUT terraform:         }
08:09:39.403 STDOUT terraform:       + vpc_id                 = (known after apply)
08:09:39.403 STDOUT terraform:     }
08:09:39.403 STDOUT terraform:   # module.vpc.aws_flow_log.this[0] will be created
08:09:39.403 STDOUT terraform:   + resource "aws_flow_log" "this" {
08:09:39.403 STDOUT terraform:       + arn                      = (known after apply)
08:09:39.403 STDOUT terraform:       + iam_role_arn             = (known after apply)
08:09:39.403 STDOUT terraform:       + id                       = (known after apply)
08:09:39.403 STDOUT terraform:       + log_destination          = (known after apply)
08:09:39.403 STDOUT terraform:       + log_destination_type     = "cloud-watch-logs"
08:09:39.403 STDOUT terraform:       + log_format               = (known after apply)
08:09:39.403 STDOUT terraform:       + log_group_name           = (known after apply)
08:09:39.403 STDOUT terraform:       + max_aggregation_interval = 60
08:09:39.403 STDOUT terraform:       + tags                     = {
08:09:39.403 STDOUT terraform:           + "Environment" = "dev"
08:09:39.403 STDOUT terraform:           + "Terragrunt"  = "true"
08:09:39.403 STDOUT terraform:           + "infra"       = "true"
08:09:39.403 STDOUT terraform:         }
08:09:39.403 STDOUT terraform:       + tags_all                 = {
08:09:39.403 STDOUT terraform:           + "Data-classification" = "internal"
08:09:39.404 STDOUT terraform:           + "Environment"         = "dev"
08:09:39.404 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:09:39.404 STDOUT terraform:           + "Organization"        = "genopsx"
08:09:39.404 STDOUT terraform:           + "Terragrunt"          = "true"
08:09:39.404 STDOUT terraform:           + "infra"               = "true"
08:09:39.404 STDOUT terraform:         }
08:09:39.404 STDOUT terraform:       + traffic_type             = "ALL"
08:09:39.404 STDOUT terraform:       + vpc_id                   = (known after apply)
08:09:39.404 STDOUT terraform:     }
08:09:39.404 STDOUT terraform:   # module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0] will be created
08:09:39.404 STDOUT terraform:   + resource "aws_iam_policy" "vpc_flow_log_cloudwatch" {
08:09:39.404 STDOUT terraform:       + arn              = (known after apply)
08:09:39.404 STDOUT terraform:       + attachment_count = (known after apply)
08:09:39.404 STDOUT terraform:       + id               = (known after apply)
08:09:39.404 STDOUT terraform:       + name             = (known after apply)
08:09:39.404 STDOUT terraform:       + name_prefix      = "vpc-flow-log-to-cloudwatch-"
08:09:39.404 STDOUT terraform:       + path             = "/"
08:09:39.404 STDOUT terraform:       + policy           = jsonencode(
08:09:39.404 STDOUT terraform:             {
08:09:39.404 STDOUT terraform:               + Statement = [
08:09:39.404 STDOUT terraform:                   + {
08:09:39.404 STDOUT terraform:                       + Action   = [
08:09:39.404 STDOUT terraform:                           + "logs:PutLogEvents",
08:09:39.404 STDOUT terraform:                           + "logs:DescribeLogStreams",
08:09:39.404 STDOUT terraform:                           + "logs:DescribeLogGroups",
08:09:39.404 STDOUT terraform:                           + "logs:CreateLogStream",
08:09:39.404 STDOUT terraform:                         ]
08:09:39.404 STDOUT terraform:                       + Effect   = "Allow"
08:09:39.404 STDOUT terraform:                       + Resource = "*"
08:09:39.404 STDOUT terraform:                       + Sid      = "AWSVPCFlowLogsPushToCloudWatch"
08:09:39.404 STDOUT terraform:                     },
08:09:39.404 STDOUT terraform:                 ]
08:09:39.404 STDOUT terraform:               + Version   = "2012-10-17"
08:09:39.404 STDOUT terraform:             }
08:09:39.404 STDOUT terraform:         )
08:09:39.404 STDOUT terraform:       + policy_id        = (known after apply)
08:09:39.404 STDOUT terraform:       + tags             = {
08:09:39.404 STDOUT terraform:           + "Environment" = "dev"
08:09:39.404 STDOUT terraform:           + "Terragrunt"  = "true"
08:09:39.404 STDOUT terraform:           + "infra"       = "true"
08:09:39.404 STDOUT terraform:         }
08:09:39.404 STDOUT terraform:       + tags_all         = {
08:09:39.404 STDOUT terraform:           + "Data-classification" = "internal"
08:09:39.404 STDOUT terraform:           + "Environment"         = "dev"
08:09:39.404 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:09:39.404 STDOUT terraform:           + "Organization"        = "genopsx"
08:09:39.404 STDOUT terraform:           + "Terragrunt"          = "true"
08:09:39.404 STDOUT terraform:           + "infra"               = "true"
08:09:39.404 STDOUT terraform:         }
08:09:39.404 STDOUT terraform:     }
08:09:39.404 STDOUT terraform:   # module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0] will be created
08:09:39.404 STDOUT terraform:   + resource "aws_iam_role" "vpc_flow_log_cloudwatch" {
08:09:39.405 STDOUT terraform:       + arn                   = (known after apply)
08:09:39.405 STDOUT terraform:       + assume_role_policy    = jsonencode(
08:09:39.405 STDOUT terraform:             {
08:09:39.405 STDOUT terraform:               + Statement = [
08:09:39.405 STDOUT terraform:                   + {
08:09:39.405 STDOUT terraform:                       + Action    = "sts:AssumeRole"
08:09:39.405 STDOUT terraform:                       + Effect    = "Allow"
08:09:39.405 STDOUT terraform:                       + Principal = {
08:09:39.405 STDOUT terraform:                           + Service = "vpc-flow-logs.amazonaws.com"
08:09:39.405 STDOUT terraform:                         }
08:09:39.405 STDOUT terraform:                       + Sid       = "AWSVPCFlowLogsAssumeRole"
08:09:39.405 STDOUT terraform:                     },
08:09:39.405 STDOUT terraform:                 ]
08:09:39.405 STDOUT terraform:               + Version   = "2012-10-17"
08:09:39.405 STDOUT terraform:             }
08:09:39.405 STDOUT terraform:         )
08:09:39.405 STDOUT terraform:       + create_date           = (known after apply)
08:09:39.405 STDOUT terraform:       + force_detach_policies = false
08:09:39.405 STDOUT terraform:       + id                    = (known after apply)
08:09:39.405 STDOUT terraform:       + managed_policy_arns   = (known after apply)
08:09:39.405 STDOUT terraform:       + max_session_duration  = 3600
08:09:39.405 STDOUT terraform:       + name                  = (known after apply)
08:09:39.405 STDOUT terraform:       + name_prefix           = "vpc-flow-log-role-"
08:09:39.405 STDOUT terraform:       + path                  = "/"
08:09:39.405 STDOUT terraform:       + tags                  = {
08:09:39.405 STDOUT terraform:           + "Environment" = "dev"
08:09:39.406 STDOUT terraform:           + "Terragrunt"  = "true"
08:09:39.406 STDOUT terraform:           + "infra"       = "true"
08:09:39.406 STDOUT terraform:         }
08:09:39.406 STDOUT terraform:       + tags_all              = {
08:09:39.406 STDOUT terraform:           + "Data-classification" = "internal"
08:09:39.406 STDOUT terraform:           + "Environment"         = "dev"
08:09:39.406 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:09:39.406 STDOUT terraform:           + "Organization"        = "genopsx"
08:09:39.406 STDOUT terraform:           + "Terragrunt"          = "true"
08:09:39.406 STDOUT terraform:           + "infra"               = "true"
08:09:39.406 STDOUT terraform:         }
08:09:39.406 STDOUT terraform:       + unique_id             = (known after apply)
08:09:39.406 STDOUT terraform:       + inline_policy (known after apply)
08:09:39.406 STDOUT terraform:     }
08:09:39.406 STDOUT terraform:   # module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0] will be created
08:09:39.406 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "vpc_flow_log_cloudwatch" {
08:09:39.406 STDOUT terraform:       + id         = (known after apply)
08:09:39.406 STDOUT terraform:       + policy_arn = (known after apply)
08:09:39.406 STDOUT terraform:       + role       = (known after apply)
08:09:39.406 STDOUT terraform:     }
08:09:39.406 STDOUT terraform:   # module.vpc.aws_internet_gateway.this[0] will be created
08:09:39.406 STDOUT terraform:   + resource "aws_internet_gateway" "this" {
08:09:39.406 STDOUT terraform:       + arn      = (known after apply)
08:09:39.406 STDOUT terraform:       + id       = (known after apply)
08:09:39.406 STDOUT terraform:       + owner_id = (known after apply)
08:09:39.406 STDOUT terraform:       + tags     = {
08:09:39.407 STDOUT terraform:           + "Environment" = "dev"
08:09:39.407 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-infra-01-vpc"
08:09:39.407 STDOUT terraform:           + "Terragrunt"  = "true"
08:09:39.407 STDOUT terraform:           + "infra"       = "true"
08:09:39.407 STDOUT terraform:         }
08:09:39.407 STDOUT terraform:       + tags_all = {
08:09:39.407 STDOUT terraform:           + "Data-classification" = "internal"
08:09:39.407 STDOUT terraform:           + "Environment"         = "dev"
08:09:39.407 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:09:39.407 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-vpc"
08:09:39.407 STDOUT terraform:           + "Organization"        = "genopsx"
08:09:39.407 STDOUT terraform:           + "Terragrunt"          = "true"
08:09:39.407 STDOUT terraform:           + "infra"               = "true"
08:09:39.407 STDOUT terraform:         }
08:09:39.407 STDOUT terraform:       + vpc_id   = (known after apply)
08:09:39.407 STDOUT terraform:     }
08:09:39.407 STDOUT terraform:   # module.vpc.aws_nat_gateway.this[0] will be created
08:09:39.407 STDOUT terraform:   + resource "aws_nat_gateway" "this" {
08:09:39.407 STDOUT terraform:       + allocation_id                      = (known after apply)
08:09:39.407 STDOUT terraform:       + association_id                     = (known after apply)
08:09:39.407 STDOUT terraform:       + connectivity_type                  = "public"
08:09:39.407 STDOUT terraform:       + id                                 = (known after apply)
08:09:39.407 STDOUT terraform:       + network_interface_id               = (known after apply)
08:09:39.408 STDOUT terraform:       + private_ip                         = (known after apply)
08:09:39.408 STDOUT terraform:       + public_ip                          = (known after apply)
08:09:39.408 STDOUT terraform:       + secondary_private_ip_address_count = (known after apply)
08:09:39.408 STDOUT terraform:       + secondary_private_ip_addresses     = (known after apply)
08:09:39.408 STDOUT terraform:       + subnet_id                          = (known after apply)
08:09:39.408 STDOUT terraform:       + tags                               = {
08:09:39.408 STDOUT terraform:           + "Environment" = "dev"
08:09:39.408 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-eu-west-1a"
08:09:39.408 STDOUT terraform:           + "Terragrunt"  = "true"
08:09:39.408 STDOUT terraform:           + "infra"       = "true"
08:09:39.408 STDOUT terraform:         }
08:09:39.408 STDOUT terraform:       + tags_all                           = {
08:09:39.408 STDOUT terraform:           + "Data-classification" = "internal"
08:09:39.408 STDOUT terraform:           + "Environment"         = "dev"
08:09:39.408 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:09:39.408 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-eu-west-1a"
08:09:39.408 STDOUT terraform:           + "Organization"        = "genopsx"
08:09:39.409 STDOUT terraform:           + "Terragrunt"          = "true"
08:09:39.409 STDOUT terraform:           + "infra"               = "true"
08:09:39.409 STDOUT terraform:         }
08:09:39.409 STDOUT terraform:     }
08:09:39.409 STDOUT terraform:   # module.vpc.aws_route.private_nat_gateway[0] will be created
08:09:39.409 STDOUT terraform:   + resource "aws_route" "private_nat_gateway" {
08:09:39.409 STDOUT terraform:       + destination_cidr_block = "0.0.0.0/0"
08:09:39.409 STDOUT terraform:       + id                     = (known after apply)
08:09:39.409 STDOUT terraform:       + instance_id            = (known after apply)
08:09:39.409 STDOUT terraform:       + instance_owner_id      = (known after apply)
08:09:39.409 STDOUT terraform:       + nat_gateway_id         = (known after apply)
08:09:39.409 STDOUT terraform:       + network_interface_id   = (known after apply)
08:09:39.409 STDOUT terraform:       + origin                 = (known after apply)
08:09:39.409 STDOUT terraform:       + route_table_id         = (known after apply)
08:09:39.409 STDOUT terraform:       + state                  = (known after apply)
08:09:39.409 STDOUT terraform:       + timeouts {
08:09:39.409 STDOUT terraform:           + create = "5m"
08:09:39.409 STDOUT terraform:         }
08:09:39.409 STDOUT terraform:     }
08:09:39.409 STDOUT terraform:   # module.vpc.aws_route.public_internet_gateway[0] will be created
08:09:39.409 STDOUT terraform:   + resource "aws_route" "public_internet_gateway" {
08:09:39.409 STDOUT terraform:       + destination_cidr_block = "0.0.0.0/0"
08:09:39.409 STDOUT terraform:       + gateway_id             = (known after apply)
08:09:39.409 STDOUT terraform:       + id                     = (known after apply)
08:09:39.409 STDOUT terraform:       + instance_id            = (known after apply)
08:09:39.409 STDOUT terraform:       + instance_owner_id      = (known after apply)
08:09:39.409 STDOUT terraform:       + network_interface_id   = (known after apply)
08:09:39.410 STDOUT terraform:       + origin                 = (known after apply)
08:09:39.410 STDOUT terraform:       + route_table_id         = (known after apply)
08:09:39.410 STDOUT terraform:       + state                  = (known after apply)
08:09:39.410 STDOUT terraform:       + timeouts {
08:09:39.410 STDOUT terraform:           + create = "5m"
08:09:39.410 STDOUT terraform:         }
08:09:39.410 STDOUT terraform:     }
08:09:39.410 STDOUT terraform:   # module.vpc.aws_route_table.private[0] will be created
08:09:39.410 STDOUT terraform:   + resource "aws_route_table" "private" {
08:09:39.410 STDOUT terraform:       + arn              = (known after apply)
08:09:39.410 STDOUT terraform:       + id               = (known after apply)
08:09:39.410 STDOUT terraform:       + owner_id         = (known after apply)
08:09:39.410 STDOUT terraform:       + propagating_vgws = (known after apply)
08:09:39.410 STDOUT terraform:       + route            = (known after apply)
08:09:39.410 STDOUT terraform:       + tags             = {
08:09:39.410 STDOUT terraform:           + "Environment" = "dev"
08:09:39.410 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-private"
08:09:39.410 STDOUT terraform:           + "Terragrunt"  = "true"
08:09:39.410 STDOUT terraform:           + "infra"       = "true"
08:09:39.410 STDOUT terraform:         }
08:09:39.410 STDOUT terraform:       + tags_all         = {
08:09:39.410 STDOUT terraform:           + "Data-classification" = "internal"
08:09:39.410 STDOUT terraform:           + "Environment"         = "dev"
08:09:39.410 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:09:39.410 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-private"
08:09:39.410 STDOUT terraform:           + "Organization"        = "genopsx"
08:09:39.410 STDOUT terraform:           + "Terragrunt"          = "true"
08:09:39.410 STDOUT terraform:           + "infra"               = "true"
08:09:39.411 STDOUT terraform:         }
08:09:39.411 STDOUT terraform:       + vpc_id           = (known after apply)
08:09:39.411 STDOUT terraform:     }
08:09:39.411 STDOUT terraform:   # module.vpc.aws_route_table.public[0] will be created
08:09:39.411 STDOUT terraform:   + resource "aws_route_table" "public" {
08:09:39.411 STDOUT terraform:       + arn              = (known after apply)
08:09:39.411 STDOUT terraform:       + id               = (known after apply)
08:09:39.411 STDOUT terraform:       + owner_id         = (known after apply)
08:09:39.411 STDOUT terraform:       + propagating_vgws = (known after apply)
08:09:39.411 STDOUT terraform:       + route            = (known after apply)
08:09:39.411 STDOUT terraform:       + tags             = {
08:09:39.411 STDOUT terraform:           + "Environment" = "dev"
08:09:39.411 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-public"
08:09:39.411 STDOUT terraform:           + "Terragrunt"  = "true"
08:09:39.411 STDOUT terraform:           + "infra"       = "true"
08:09:39.411 STDOUT terraform:         }
08:09:39.411 STDOUT terraform:       + tags_all         = {
08:09:39.411 STDOUT terraform:           + "Data-classification" = "internal"
08:09:39.411 STDOUT terraform:           + "Environment"         = "dev"
08:09:39.411 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:09:39.411 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-public"
08:09:39.411 STDOUT terraform:           + "Organization"        = "genopsx"
08:09:39.411 STDOUT terraform:           + "Terragrunt"          = "true"
08:09:39.411 STDOUT terraform:           + "infra"               = "true"
08:09:39.411 STDOUT terraform:         }
08:09:39.411 STDOUT terraform:       + vpc_id           = (known after apply)
08:09:39.411 STDOUT terraform:     }
08:09:39.411 STDOUT terraform:   # module.vpc.aws_route_table_association.database[0] will be created
08:09:39.411 STDOUT terraform:   + resource "aws_route_table_association" "database" {
08:09:39.411 STDOUT terraform:       + id             = (known after apply)
08:09:39.411 STDOUT terraform:       + route_table_id = (known after apply)
08:09:39.412 STDOUT terraform:       + subnet_id      = (known after apply)
08:09:39.412 STDOUT terraform:     }
08:09:39.412 STDOUT terraform:   # module.vpc.aws_route_table_association.database[1] will be created
08:09:39.412 STDOUT terraform:   + resource "aws_route_table_association" "database" {
08:09:39.412 STDOUT terraform:       + id             = (known after apply)
08:09:39.412 STDOUT terraform:       + route_table_id = (known after apply)
08:09:39.412 STDOUT terraform:       + subnet_id      = (known after apply)
08:09:39.412 STDOUT terraform:     }
08:09:39.412 STDOUT terraform:   # module.vpc.aws_route_table_association.database[2] will be created
08:09:39.412 STDOUT terraform:   + resource "aws_route_table_association" "database" {
08:09:39.412 STDOUT terraform:       + id             = (known after apply)
08:09:39.412 STDOUT terraform:       + route_table_id = (known after apply)
08:09:39.412 STDOUT terraform:       + subnet_id      = (known after apply)
08:09:39.412 STDOUT terraform:     }
08:09:39.412 STDOUT terraform:   # module.vpc.aws_route_table_association.private[0] will be created
08:09:39.412 STDOUT terraform:   + resource "aws_route_table_association" "private" {
08:09:39.412 STDOUT terraform:       + id             = (known after apply)
08:09:39.412 STDOUT terraform:       + route_table_id = (known after apply)
08:09:39.412 STDOUT terraform:       + subnet_id      = (known after apply)
08:09:39.412 STDOUT terraform:     }
08:09:39.412 STDOUT terraform:   # module.vpc.aws_route_table_association.private[1] will be created
08:09:39.412 STDOUT terraform:   + resource "aws_route_table_association" "private" {
08:09:39.412 STDOUT terraform:       + id             = (known after apply)
08:09:39.412 STDOUT terraform:       + route_table_id = (known after apply)
08:09:39.412 STDOUT terraform:       + subnet_id      = (known after apply)
08:09:39.412 STDOUT terraform:     }
08:09:39.412 STDOUT terraform:   # module.vpc.aws_route_table_association.private[2] will be created
08:09:39.413 STDOUT terraform:   + resource "aws_route_table_association" "private" {
08:09:39.413 STDOUT terraform:       + id             = (known after apply)
08:09:39.413 STDOUT terraform:       + route_table_id = (known after apply)
08:09:39.413 STDOUT terraform:       + subnet_id      = (known after apply)
08:09:39.413 STDOUT terraform:     }
08:09:39.413 STDOUT terraform:   # module.vpc.aws_route_table_association.public[0] will be created
08:09:39.413 STDOUT terraform:   + resource "aws_route_table_association" "public" {
08:09:39.413 STDOUT terraform:       + id             = (known after apply)
08:09:39.413 STDOUT terraform:       + route_table_id = (known after apply)
08:09:39.413 STDOUT terraform:       + subnet_id      = (known after apply)
08:09:39.413 STDOUT terraform:     }
08:09:39.413 STDOUT terraform:   # module.vpc.aws_route_table_association.public[1] will be created
08:09:39.413 STDOUT terraform:   + resource "aws_route_table_association" "public" {
08:09:39.413 STDOUT terraform:       + id             = (known after apply)
08:09:39.413 STDOUT terraform:       + route_table_id = (known after apply)
08:09:39.413 STDOUT terraform:       + subnet_id      = (known after apply)
08:09:39.413 STDOUT terraform:     }
08:09:39.413 STDOUT terraform:   # module.vpc.aws_route_table_association.public[2] will be created
08:09:39.413 STDOUT terraform:   + resource "aws_route_table_association" "public" {
08:09:39.413 STDOUT terraform:       + id             = (known after apply)
08:09:39.413 STDOUT terraform:       + route_table_id = (known after apply)
08:09:39.413 STDOUT terraform:       + subnet_id      = (known after apply)
08:09:39.413 STDOUT terraform:     }
08:09:39.413 STDOUT terraform:   # module.vpc.aws_subnet.database[0] will be created
08:09:39.413 STDOUT terraform:   + resource "aws_subnet" "database" {
08:09:39.413 STDOUT terraform:       + arn                                            = (known after apply)
08:09:39.414 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
08:09:39.414 STDOUT terraform:       + availability_zone                              = "eu-west-1a"
08:09:39.414 STDOUT terraform:       + availability_zone_id                           = (known after apply)
08:09:39.414 STDOUT terraform:       + cidr_block                                     = "10.0.21.0/24"
08:09:39.414 STDOUT terraform:       + enable_dns64                                   = false
08:09:39.414 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
08:09:39.414 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
08:09:39.414 STDOUT terraform:       + id                                             = (known after apply)
08:09:39.414 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
08:09:39.414 STDOUT terraform:       + ipv6_native                                    = false
08:09:39.414 STDOUT terraform:       + map_public_ip_on_launch                        = false
08:09:39.414 STDOUT terraform:       + owner_id                                       = (known after apply)
08:09:39.414 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
08:09:39.414 STDOUT terraform:       + tags                                           = {
08:09:39.414 STDOUT terraform:           + "Environment" = "dev"
08:09:39.414 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-db-eu-west-1a"
08:09:39.414 STDOUT terraform:           + "Terragrunt"  = "true"
08:09:39.414 STDOUT terraform:           + "infra"       = "true"
08:09:39.414 STDOUT terraform:         }
08:09:39.414 STDOUT terraform:       + tags_all                                       = {
08:09:39.414 STDOUT terraform:           + "Data-classification" = "internal"
08:09:39.414 STDOUT terraform:           + "Environment"         = "dev"
08:09:39.414 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:09:39.415 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-db-eu-west-1a"
08:09:39.415 STDOUT terraform:           + "Organization"        = "genopsx"
08:09:39.415 STDOUT terraform:           + "Terragrunt"          = "true"
08:09:39.415 STDOUT terraform:           + "infra"               = "true"
08:09:39.415 STDOUT terraform:         }
08:09:39.415 STDOUT terraform:       + vpc_id                                         = (known after apply)
08:09:39.415 STDOUT terraform:     }
08:09:39.415 STDOUT terraform:   # module.vpc.aws_subnet.database[1] will be created
08:09:39.415 STDOUT terraform:   + resource "aws_subnet" "database" {
08:09:39.415 STDOUT terraform:       + arn                                            = (known after apply)
08:09:39.415 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
08:09:39.415 STDOUT terraform:       + availability_zone                              = "eu-west-1b"
08:09:39.415 STDOUT terraform:       + availability_zone_id                           = (known after apply)
08:09:39.415 STDOUT terraform:       + cidr_block                                     = "10.0.22.0/24"
08:09:39.415 STDOUT terraform:       + enable_dns64                                   = false
08:09:39.415 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
08:09:39.415 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
08:09:39.415 STDOUT terraform:       + id                                             = (known after apply)
08:09:39.415 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
08:09:39.415 STDOUT terraform:       + ipv6_native                                    = false
08:09:39.415 STDOUT terraform:       + map_public_ip_on_launch                        = false
08:09:39.415 STDOUT terraform:       + owner_id                                       = (known after apply)
08:09:39.415 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
08:09:39.415 STDOUT terraform:       + tags                                           = {
08:09:39.415 STDOUT terraform:           + "Environment" = "dev"
08:09:39.415 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-db-eu-west-1b"
08:09:39.415 STDOUT terraform:           + "Terragrunt"  = "true"
08:09:39.415 STDOUT terraform:           + "infra"       = "true"
08:09:39.415 STDOUT terraform:         }
08:09:39.416 STDOUT terraform:       + tags_all                                       = {
08:09:39.416 STDOUT terraform:           + "Data-classification" = "internal"
08:09:39.416 STDOUT terraform:           + "Environment"         = "dev"
08:09:39.416 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:09:39.416 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-db-eu-west-1b"
08:09:39.416 STDOUT terraform:           + "Organization"        = "genopsx"
08:09:39.416 STDOUT terraform:           + "Terragrunt"          = "true"
08:09:39.416 STDOUT terraform:           + "infra"               = "true"
08:09:39.416 STDOUT terraform:         }
08:09:39.416 STDOUT terraform:       + vpc_id                                         = (known after apply)
08:09:39.416 STDOUT terraform:     }
08:09:39.416 STDOUT terraform:   # module.vpc.aws_subnet.database[2] will be created
08:09:39.416 STDOUT terraform:   + resource "aws_subnet" "database" {
08:09:39.416 STDOUT terraform:       + arn                                            = (known after apply)
08:09:39.416 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
08:09:39.416 STDOUT terraform:       + availability_zone                              = "eu-west-1c"
08:09:39.416 STDOUT terraform:       + availability_zone_id                           = (known after apply)
08:09:39.416 STDOUT terraform:       + cidr_block                                     = "10.0.23.0/24"
08:09:39.416 STDOUT terraform:       + enable_dns64                                   = false
08:09:39.416 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
08:09:39.416 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
08:09:39.416 STDOUT terraform:       + id                                             = (known after apply)
08:09:39.416 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
08:09:39.416 STDOUT terraform:       + ipv6_native                                    = false
08:09:39.416 STDOUT terraform:       + map_public_ip_on_launch                        = false
08:09:39.416 STDOUT terraform:       + owner_id                                       = (known after apply)
08:09:39.416 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
08:09:39.416 STDOUT terraform:       + tags                                           = {
08:09:39.416 STDOUT terraform:           + "Environment" = "dev"
08:09:39.416 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-db-eu-west-1c"
08:09:39.416 STDOUT terraform:           + "Terragrunt"  = "true"
08:09:39.417 STDOUT terraform:           + "infra"       = "true"
08:09:39.417 STDOUT terraform:         }
08:09:39.417 STDOUT terraform:       + tags_all                                       = {
08:09:39.417 STDOUT terraform:           + "Data-classification" = "internal"
08:09:39.417 STDOUT terraform:           + "Environment"         = "dev"
08:09:39.417 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:09:39.417 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-db-eu-west-1c"
08:09:39.417 STDOUT terraform:           + "Organization"        = "genopsx"
08:09:39.417 STDOUT terraform:           + "Terragrunt"          = "true"
08:09:39.417 STDOUT terraform:           + "infra"               = "true"
08:09:39.417 STDOUT terraform:         }
08:09:39.417 STDOUT terraform:       + vpc_id                                         = (known after apply)
08:09:39.417 STDOUT terraform:     }
08:09:39.417 STDOUT terraform:   # module.vpc.aws_subnet.private[0] will be created
08:09:39.417 STDOUT terraform:   + resource "aws_subnet" "private" {
08:09:39.417 STDOUT terraform:       + arn                                            = (known after apply)
08:09:39.417 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
08:09:39.417 STDOUT terraform:       + availability_zone                              = "eu-west-1a"
08:09:39.417 STDOUT terraform:       + availability_zone_id                           = (known after apply)
08:09:39.417 STDOUT terraform:       + cidr_block                                     = "10.0.1.0/24"
08:09:39.417 STDOUT terraform:       + enable_dns64                                   = false
08:09:39.417 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
08:09:39.417 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
08:09:39.417 STDOUT terraform:       + id                                             = (known after apply)
08:09:39.417 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
08:09:39.417 STDOUT terraform:       + ipv6_native                                    = false
08:09:39.417 STDOUT terraform:       + map_public_ip_on_launch                        = false
08:09:39.417 STDOUT terraform:       + owner_id                                       = (known after apply)
08:09:39.417 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
08:09:39.417 STDOUT terraform:       + tags                                           = {
08:09:39.417 STDOUT terraform:           + "Environment"                     = "dev"
08:09:39.417 STDOUT terraform:           + "Name"                            = "sbx-dev-eu-west-1-infra-01-vpc-private-eu-west-1a"
08:09:39.418 STDOUT terraform:           + "PrivateSubnet"                   = "true"
08:09:39.418 STDOUT terraform:           + "Terragrunt"                      = "true"
08:09:39.418 STDOUT terraform:           + "infra"                           = "true"
08:09:39.418 STDOUT terraform:           + "kubernetes.io/role/internal-elb" = "1"
08:09:39.418 STDOUT terraform:         }
08:09:39.418 STDOUT terraform:       + tags_all                                       = {
08:09:39.418 STDOUT terraform:           + "Data-classification"             = "internal"
08:09:39.418 STDOUT terraform:           + "Environment"                     = "dev"
08:09:39.418 STDOUT terraform:           + "Managed-by"                      = "terragrunt"
08:09:39.418 STDOUT terraform:           + "Name"                            = "sbx-dev-eu-west-1-infra-01-vpc-private-eu-west-1a"
08:09:39.418 STDOUT terraform:           + "Organization"                    = "genopsx"
08:09:39.418 STDOUT terraform:           + "PrivateSubnet"                   = "true"
08:09:39.418 STDOUT terraform:           + "Terragrunt"                      = "true"
08:09:39.418 STDOUT terraform:           + "infra"                           = "true"
08:09:39.418 STDOUT terraform:           + "kubernetes.io/role/internal-elb" = "1"
08:09:39.418 STDOUT terraform:         }
08:09:39.418 STDOUT terraform:       + vpc_id                                         = (known after apply)
08:09:39.418 STDOUT terraform:     }
08:09:39.418 STDOUT terraform:   # module.vpc.aws_subnet.private[1] will be created
08:09:39.418 STDOUT terraform:   + resource "aws_subnet" "private" {
08:09:39.418 STDOUT terraform:       + arn                                            = (known after apply)
08:09:39.418 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
08:09:39.418 STDOUT terraform:       + availability_zone                              = "eu-west-1b"
08:09:39.418 STDOUT terraform:       + availability_zone_id                           = (known after apply)
08:09:39.418 STDOUT terraform:       + cidr_block                                     = "10.0.2.0/24"
08:09:39.418 STDOUT terraform:       + enable_dns64                                   = false
08:09:39.418 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
08:09:39.418 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
08:09:39.418 STDOUT terraform:       + id                                             = (known after apply)
08:09:39.418 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
08:09:39.419 STDOUT terraform:       + ipv6_native                                    = false
08:09:39.419 STDOUT terraform:       + map_public_ip_on_launch                        = false
08:09:39.419 STDOUT terraform:       + owner_id                                       = (known after apply)
08:09:39.419 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
08:09:39.419 STDOUT terraform:       + tags                                           = {
08:09:39.419 STDOUT terraform:           + "Environment"                     = "dev"
08:09:39.419 STDOUT terraform:           + "Name"                            = "sbx-dev-eu-west-1-infra-01-vpc-private-eu-west-1b"
08:09:39.419 STDOUT terraform:           + "PrivateSubnet"                   = "true"
08:09:39.419 STDOUT terraform:           + "Terragrunt"                      = "true"
08:09:39.419 STDOUT terraform:           + "infra"                           = "true"
08:09:39.419 STDOUT terraform:           + "kubernetes.io/role/internal-elb" = "1"
08:09:39.419 STDOUT terraform:         }
08:09:39.419 STDOUT terraform:       + tags_all                                       = {
08:09:39.419 STDOUT terraform:           + "Data-classification"             = "internal"
08:09:39.419 STDOUT terraform:           + "Environment"                     = "dev"
08:09:39.419 STDOUT terraform:           + "Managed-by"                      = "terragrunt"
08:09:39.419 STDOUT terraform:           + "Name"                            = "sbx-dev-eu-west-1-infra-01-vpc-private-eu-west-1b"
08:09:39.419 STDOUT terraform:           + "Organization"                    = "genopsx"
08:09:39.419 STDOUT terraform:           + "PrivateSubnet"                   = "true"
08:09:39.419 STDOUT terraform:           + "Terragrunt"                      = "true"
08:09:39.419 STDOUT terraform:           + "infra"                           = "true"
08:09:39.419 STDOUT terraform:           + "kubernetes.io/role/internal-elb" = "1"
08:09:39.419 STDOUT terraform:         }
08:09:39.419 STDOUT terraform:       + vpc_id                                         = (known after apply)
08:09:39.419 STDOUT terraform:     }
08:09:39.419 STDOUT terraform:   # module.vpc.aws_subnet.private[2] will be created
08:09:39.419 STDOUT terraform:   + resource "aws_subnet" "private" {
08:09:39.419 STDOUT terraform:       + arn                                            = (known after apply)
08:09:39.419 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
08:09:39.419 STDOUT terraform:       + availability_zone                              = "eu-west-1c"
08:09:39.420 STDOUT terraform:       + availability_zone_id                           = (known after apply)
08:09:39.420 STDOUT terraform:       + cidr_block                                     = "10.0.3.0/24"
08:09:39.420 STDOUT terraform:       + enable_dns64                                   = false
08:09:39.420 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
08:09:39.420 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
08:09:39.420 STDOUT terraform:       + id                                             = (known after apply)
08:09:39.420 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
08:09:39.420 STDOUT terraform:       + ipv6_native                                    = false
08:09:39.420 STDOUT terraform:       + map_public_ip_on_launch                        = false
08:09:39.420 STDOUT terraform:       + owner_id                                       = (known after apply)
08:09:39.420 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
08:09:39.420 STDOUT terraform:       + tags                                           = {
08:09:39.420 STDOUT terraform:           + "Environment"                     = "dev"
08:09:39.420 STDOUT terraform:           + "Name"                            = "sbx-dev-eu-west-1-infra-01-vpc-private-eu-west-1c"
08:09:39.420 STDOUT terraform:           + "PrivateSubnet"                   = "true"
08:09:39.420 STDOUT terraform:           + "Terragrunt"                      = "true"
08:09:39.420 STDOUT terraform:           + "infra"                           = "true"
08:09:39.420 STDOUT terraform:           + "kubernetes.io/role/internal-elb" = "1"
08:09:39.420 STDOUT terraform:         }
08:09:39.420 STDOUT terraform:       + tags_all                                       = {
08:09:39.420 STDOUT terraform:           + "Data-classification"             = "internal"
08:09:39.420 STDOUT terraform:           + "Environment"                     = "dev"
08:09:39.420 STDOUT terraform:           + "Managed-by"                      = "terragrunt"
08:09:39.420 STDOUT terraform:           + "Name"                            = "sbx-dev-eu-west-1-infra-01-vpc-private-eu-west-1c"
08:09:39.420 STDOUT terraform:           + "Organization"                    = "genopsx"
08:09:39.420 STDOUT terraform:           + "PrivateSubnet"                   = "true"
08:09:39.420 STDOUT terraform:           + "Terragrunt"                      = "true"
08:09:39.420 STDOUT terraform:           + "infra"                           = "true"
08:09:39.421 STDOUT terraform:           + "kubernetes.io/role/internal-elb" = "1"
08:09:39.421 STDOUT terraform:         }
08:09:39.421 STDOUT terraform:       + vpc_id                                         = (known after apply)
08:09:39.421 STDOUT terraform:     }
08:09:39.421 STDOUT terraform:   # module.vpc.aws_subnet.public[0] will be created
08:09:39.421 STDOUT terraform:   + resource "aws_subnet" "public" {
08:09:39.421 STDOUT terraform:       + arn                                            = (known after apply)
08:09:39.421 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
08:09:39.421 STDOUT terraform:       + availability_zone                              = "eu-west-1a"
08:09:39.421 STDOUT terraform:       + availability_zone_id                           = (known after apply)
08:09:39.421 STDOUT terraform:       + cidr_block                                     = "10.0.101.0/24"
08:09:39.421 STDOUT terraform:       + enable_dns64                                   = false
08:09:39.421 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
08:09:39.421 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
08:09:39.421 STDOUT terraform:       + id                                             = (known after apply)
08:09:39.421 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
08:09:39.421 STDOUT terraform:       + ipv6_native                                    = false
08:09:39.421 STDOUT terraform:       + map_public_ip_on_launch                        = true
08:09:39.421 STDOUT terraform:       + owner_id                                       = (known after apply)
08:09:39.421 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
08:09:39.421 STDOUT terraform:       + tags                                           = {
08:09:39.421 STDOUT terraform:           + "Environment"            = "dev"
08:09:39.421 STDOUT terraform:           + "Name"                   = "sbx-dev-eu-west-1-infra-01-vpc-public-eu-west-1a"
08:09:39.421 STDOUT terraform:           + "PublicSubnet"           = "true"
08:09:39.421 STDOUT terraform:           + "Terragrunt"             = "true"
08:09:39.421 STDOUT terraform:           + "infra"                  = "true"
08:09:39.421 STDOUT terraform:           + "kubernetes.io/role/elb" = "1"
08:09:39.421 STDOUT terraform:         }
08:09:39.421 STDOUT terraform:       + tags_all                                       = {
08:09:39.421 STDOUT terraform:           + "Data-classification"    = "internal"
08:09:39.421 STDOUT terraform:           + "Environment"            = "dev"
08:09:39.421 STDOUT terraform:           + "Managed-by"             = "terragrunt"
08:09:39.422 STDOUT terraform:           + "Name"                   = "sbx-dev-eu-west-1-infra-01-vpc-public-eu-west-1a"
08:09:39.422 STDOUT terraform:           + "Organization"           = "genopsx"
08:09:39.422 STDOUT terraform:           + "PublicSubnet"           = "true"
08:09:39.422 STDOUT terraform:           + "Terragrunt"             = "true"
08:09:39.422 STDOUT terraform:           + "infra"                  = "true"
08:09:39.422 STDOUT terraform:           + "kubernetes.io/role/elb" = "1"
08:09:39.422 STDOUT terraform:         }
08:09:39.422 STDOUT terraform:       + vpc_id                                         = (known after apply)
08:09:39.422 STDOUT terraform:     }
08:09:39.422 STDOUT terraform:   # module.vpc.aws_subnet.public[1] will be created
08:09:39.422 STDOUT terraform:   + resource "aws_subnet" "public" {
08:09:39.422 STDOUT terraform:       + arn                                            = (known after apply)
08:09:39.422 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
08:09:39.422 STDOUT terraform:       + availability_zone                              = "eu-west-1b"
08:09:39.422 STDOUT terraform:       + availability_zone_id                           = (known after apply)
08:09:39.422 STDOUT terraform:       + cidr_block                                     = "10.0.102.0/24"
08:09:39.422 STDOUT terraform:       + enable_dns64                                   = false
08:09:39.422 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
08:09:39.422 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
08:09:39.422 STDOUT terraform:       + id                                             = (known after apply)
08:09:39.422 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
08:09:39.422 STDOUT terraform:       + ipv6_native                                    = false
08:09:39.422 STDOUT terraform:       + map_public_ip_on_launch                        = true
08:09:39.422 STDOUT terraform:       + owner_id                                       = (known after apply)
08:09:39.422 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
08:09:39.422 STDOUT terraform:       + tags                                           = {
08:09:39.422 STDOUT terraform:           + "Environment"            = "dev"
08:09:39.422 STDOUT terraform:           + "Name"                   = "sbx-dev-eu-west-1-infra-01-vpc-public-eu-west-1b"
08:09:39.422 STDOUT terraform:           + "PublicSubnet"           = "true"
08:09:39.422 STDOUT terraform:           + "Terragrunt"             = "true"
08:09:39.422 STDOUT terraform:           + "infra"                  = "true"
08:09:39.423 STDOUT terraform:           + "kubernetes.io/role/elb" = "1"
08:09:39.423 STDOUT terraform:         }
08:09:39.423 STDOUT terraform:       + tags_all                                       = {
08:09:39.423 STDOUT terraform:           + "Data-classification"    = "internal"
08:09:39.423 STDOUT terraform:           + "Environment"            = "dev"
08:09:39.423 STDOUT terraform:           + "Managed-by"             = "terragrunt"
08:09:39.423 STDOUT terraform:           + "Name"                   = "sbx-dev-eu-west-1-infra-01-vpc-public-eu-west-1b"
08:09:39.423 STDOUT terraform:           + "Organization"           = "genopsx"
08:09:39.423 STDOUT terraform:           + "PublicSubnet"           = "true"
08:09:39.423 STDOUT terraform:           + "Terragrunt"             = "true"
08:09:39.423 STDOUT terraform:           + "infra"                  = "true"
08:09:39.423 STDOUT terraform:           + "kubernetes.io/role/elb" = "1"
08:09:39.423 STDOUT terraform:         }
08:09:39.423 STDOUT terraform:       + vpc_id                                         = (known after apply)
08:09:39.423 STDOUT terraform:     }
08:09:39.423 STDOUT terraform:   # module.vpc.aws_subnet.public[2] will be created
08:09:39.423 STDOUT terraform:   + resource "aws_subnet" "public" {
08:09:39.423 STDOUT terraform:       + arn                                            = (known after apply)
08:09:39.423 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
08:09:39.423 STDOUT terraform:       + availability_zone                              = "eu-west-1c"
08:09:39.423 STDOUT terraform:       + availability_zone_id                           = (known after apply)
08:09:39.423 STDOUT terraform:       + cidr_block                                     = "10.0.103.0/24"
08:09:39.423 STDOUT terraform:       + enable_dns64                                   = false
08:09:39.423 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
08:09:39.423 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
08:09:39.423 STDOUT terraform:       + id                                             = (known after apply)
08:09:39.423 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
08:09:39.423 STDOUT terraform:       + ipv6_native                                    = false
08:09:39.423 STDOUT terraform:       + map_public_ip_on_launch                        = true
08:09:39.423 STDOUT terraform:       + owner_id                                       = (known after apply)
08:09:39.423 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
08:09:39.423 STDOUT terraform:       + tags                                           = {
08:09:39.424 STDOUT terraform:           + "Environment"            = "dev"
08:09:39.424 STDOUT terraform:           + "Name"                   = "sbx-dev-eu-west-1-infra-01-vpc-public-eu-west-1c"
08:09:39.424 STDOUT terraform:           + "PublicSubnet"           = "true"
08:09:39.424 STDOUT terraform:           + "Terragrunt"             = "true"
08:09:39.424 STDOUT terraform:           + "infra"                  = "true"
08:09:39.424 STDOUT terraform:           + "kubernetes.io/role/elb" = "1"
08:09:39.424 STDOUT terraform:         }
08:09:39.424 STDOUT terraform:       + tags_all                                       = {
08:09:39.424 STDOUT terraform:           + "Data-classification"    = "internal"
08:09:39.424 STDOUT terraform:           + "Environment"            = "dev"
08:09:39.424 STDOUT terraform:           + "Managed-by"             = "terragrunt"
08:09:39.424 STDOUT terraform:           + "Name"                   = "sbx-dev-eu-west-1-infra-01-vpc-public-eu-west-1c"
08:09:39.424 STDOUT terraform:           + "Organization"           = "genopsx"
08:09:39.424 STDOUT terraform:           + "PublicSubnet"           = "true"
08:09:39.424 STDOUT terraform:           + "Terragrunt"             = "true"
08:09:39.424 STDOUT terraform:           + "infra"                  = "true"
08:09:39.424 STDOUT terraform:           + "kubernetes.io/role/elb" = "1"
08:09:39.424 STDOUT terraform:         }
08:09:39.424 STDOUT terraform:       + vpc_id                                         = (known after apply)
08:09:39.424 STDOUT terraform:     }
08:09:39.424 STDOUT terraform:   # module.vpc.aws_vpc.this[0] will be created
08:09:39.424 STDOUT terraform:   + resource "aws_vpc" "this" {
08:09:39.424 STDOUT terraform:       + arn                                  = (known after apply)
08:09:39.424 STDOUT terraform:       + cidr_block                           = "10.0.0.0/16"
08:09:39.424 STDOUT terraform:       + default_network_acl_id               = (known after apply)
08:09:39.424 STDOUT terraform:       + default_route_table_id               = (known after apply)
08:09:39.424 STDOUT terraform:       + default_security_group_id            = (known after apply)
08:09:39.424 STDOUT terraform:       + dhcp_options_id                      = (known after apply)
08:09:39.424 STDOUT terraform:       + enable_dns_hostnames                 = true
08:09:39.424 STDOUT terraform:       + enable_dns_support                   = true
08:09:39.424 STDOUT terraform:       + enable_network_address_usage_metrics = (known after apply)
08:09:39.424 STDOUT terraform:       + id                                   = (known after apply)
08:09:39.424 STDOUT terraform:       + instance_tenancy                     = "default"
08:09:39.424 STDOUT terraform:       + ipv6_association_id                  = (known after apply)
08:09:39.424 STDOUT terraform:       + ipv6_cidr_block                      = (known after apply)
08:09:39.424 STDOUT terraform:       + ipv6_cidr_block_network_border_group = (known after apply)
08:09:39.425 STDOUT terraform:       + main_route_table_id                  = (known after apply)
08:09:39.425 STDOUT terraform:       + owner_id                             = (known after apply)
08:09:39.425 STDOUT terraform:       + tags                                 = {
08:09:39.425 STDOUT terraform:           + "Environment" = "dev"
08:09:39.425 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-infra-01-vpc"
08:09:39.425 STDOUT terraform:           + "Terragrunt"  = "true"
08:09:39.425 STDOUT terraform:           + "infra"       = "true"
08:09:39.425 STDOUT terraform:         }
08:09:39.425 STDOUT terraform:       + tags_all                             = {
08:09:39.425 STDOUT terraform:           + "Data-classification" = "internal"
08:09:39.425 STDOUT terraform:           + "Environment"         = "dev"
08:09:39.425 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:09:39.425 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-infra-01-vpc"
08:09:39.425 STDOUT terraform:           + "Organization"        = "genopsx"
08:09:39.425 STDOUT terraform:           + "Terragrunt"          = "true"
08:09:39.425 STDOUT terraform:           + "infra"               = "true"
08:09:39.425 STDOUT terraform:         }
08:09:39.425 STDOUT terraform:     }
08:09:39.425 STDOUT terraform: Plan: 35 to add, 0 to change, 0 to destroy.
08:09:39.425 STDOUT terraform: Changes to Outputs:
08:09:39.425 STDOUT terraform:   + azs              = [
08:09:39.425 STDOUT terraform:       + "eu-west-1a",
08:09:39.425 STDOUT terraform:       + "eu-west-1b",
08:09:39.425 STDOUT terraform:       + "eu-west-1c",
08:09:39.425 STDOUT terraform:     ]
08:09:39.425 STDOUT terraform:   + database_subnets = [
08:09:39.425 STDOUT terraform:       + (known after apply),
08:09:39.425 STDOUT terraform:       + (known after apply),
08:09:39.425 STDOUT terraform:       + (known after apply),
08:09:39.425 STDOUT terraform:     ]
08:09:39.425 STDOUT terraform:   + private_subnets  = [
08:09:39.425 STDOUT terraform:       + (known after apply),
08:09:39.425 STDOUT terraform:       + (known after apply),
08:09:39.425 STDOUT terraform:       + (known after apply),
08:09:39.425 STDOUT terraform:     ]
08:09:39.425 STDOUT terraform:   + public_subnets   = [
08:09:39.425 STDOUT terraform:       + (known after apply),
08:09:39.425 STDOUT terraform:       + (known after apply),
08:09:39.425 STDOUT terraform:       + (known after apply),
08:09:39.425 STDOUT terraform:     ]
08:09:39.425 STDOUT terraform:   + vpc_cidr_block   = "10.0.0.0/16"
08:09:39.425 STDOUT terraform:   + vpc_id           = (known after apply)
08:09:39.425 STDOUT terraform:   + vpc_name         = "sbx-dev-eu-west-1-infra-01-vpc"
```

💰 Infracost estimate for `sbx/eu-west-1/infra-01/vpc`
```
Project: main

 Name                                                Monthly Qty  Unit              Monthly Cost   
                                                                                                   
 module.vpc.aws_nat_gateway.this[0]                                                                
 ├─ NAT gateway                                              730  hours                   $35.04   
 └─ Data processed                                Monthly cost depends on usage: $0.048 per GB     
                                                                                                   
 module.vpc.aws_cloudwatch_log_group.flow_log[0]                                                   
 ├─ Data ingested                                 Monthly cost depends on usage: $0.57 per GB      
 ├─ Archival Storage                              Monthly cost depends on usage: $0.03 per GB      
 └─ Insights queries data scanned                 Monthly cost depends on usage: $0.0057 per GB    
                                                                                                   
 OVERALL TOTAL                                                                           $35.04 

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

──────────────────────────────────
35 cloud resources were detected:
∙ 2 were estimated
∙ 33 were free

┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━┓
┃ Project                                            ┃ Baseline cost ┃ Usage cost* ┃ Total cost ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━┫
┃ main                                               ┃           $35 ┃           - ┃        $35 ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━┛
```
